jonacappelle/nRF52-BLE-IMU/main.c
    err_code = ts_init(&ts_params);
    APP_ERROR_CHECK(err_code);
    
    err_code = ts_enable();
    APP_ERROR_CHECK(err_code);
    
    NRF_LOG_INFO("Started listening for beacons.\r\n");
    NRF_LOG_INFO("Press Button 1 to start sending sync beacons\r\n");
}


/// Timer at 100 Hz
bool timer_datasend_int = false;



// Event handler for scheduler
void my_app_sched_event_handler(void *data, uint16_t size);




/**@brief Application main function.
 */
int main(void)
{
		uint32_t err_code;
	
    bool erase_bonds;
	
    // Initialize.
    uart_init();
    log_init();
    timers_init();
    buttons_leds_init(&erase_bonds);
    power_management_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();
	
		// Application scheduler (soft interrupt like)
		APP_SCHED_INIT(SCHED_MAX_EVENT_DATA_SIZE, SCHED_QUEUE_SIZE);
	
		// TimeSync
		sync_timer_button_init();
	
	
	// GPIO stuff for timing purposes
	////////////////////////////////	
		nrf_gpio_cfg_output(18);
		nrf_gpio_cfg_output(19);
		nrf_gpio_cfg_output(20);
	////////////////////////////////
		nrf_gpio_cfg_output(25);
		nrf_gpio_pin_set(25);
		nrf_gpio_pin_set(20);
		nrf_delay_ms(1000);
		nrf_gpio_pin_clear(25);
		nrf_gpio_pin_clear(20);
		nrf_delay_ms(1000);
	////////////////////////////////
		

    // Start execution.
    printf("\r\nUART started.\r\n");
    NRF_LOG_INFO("Debug logging for UART over RTT started.");
    advertising_start();
		

	
//		APP_ERROR_CHECK(NRF_LOG_INIT(NULL));
//    NRF_LOG_DEFAULT_BACKENDS_INIT();

    NRF_LOG_INFO("\r\nSTART");
		NRF_LOG_FLUSH();
	
		/* Initialize GPIO pins */
		gpio_init();
		
		/* Initialize us timer */
		timer_init();
		
		/* Initialize timer: Generates interrupt at 100 Hz */
		timer_datasend_init();
		
		// Initialize IMU
		err_code = imu_init();
		APP_ERROR_CHECK(err_code);
		
		
		// Delay before starting
		nrf_delay_ms(5000);
		
		////////////////////////////////////////////////////////////////	
		// Loop: IMU gives interrupt -> bool interrupt = true -> poll device for data
		////////////////////////////////////////////////////////////////		
		while(1)
		{
			
			
			// App scheduler: handle event in buffer
			app_sched_execute();
			
/////////////////////////////////////////////////////////////////////////////////	
//// Send data over BLE as fast as possible			
/////////////////////////////////////////////////////////////////////////////////
			
			// if NUS TX buffer isn't full and imu_bytes_available() TODO add
			if(!nus_buffer_full) 
			{
				uint32_t err_code;
				do
				{
						// Load new data into buffer after NRF_SUCCESS (previous data has successfully been queued)
						if(NUS_send_OK)
						{
//							IMU_data_get();
						}
						// Try to send data over BLE NUS
						err_code = nus_printf_custom("2	Test 0123456789 0123456789 0123456789 0123456789 0123456789 0123456789 0123456789 0123456789 0123456789 0123456789 0123456789 0123456789 0123456789\n\0");
//						err_code = nus_printf_custom("Test 123\n\0");
						
						// Packet has successfully been queued and send correctly
						// If this happens, load new data into buffer
						if(err_code == NRF_SUCCESS)
						{
							NUS_send_OK = true; // Ok, buffer is not full yet, buffer next data
							countrrr++; // Increment send counter
							NRF_LOG_INFO("NUS SUCCESS! %d", countrrr);
						}
						// If NUS send buffer is full, do not load new data into buffer 
						// + stop queue of data until BLE_NUS_EVT_TX_RDY
						if (err_code == NRF_ERROR_RESOURCES)
						{
							NUS_send_OK = false; // NUS send buffer is full
							nus_buffer_full = true; // NUS send buffer is full
//							NRF_LOG_INFO("NUS TX Buffer full!");
						}
				} while (err_code == NRF_SUCCESS);
			}
/////////////////////////////////////////////////////////////////////////////////
			
			// Flush all the debug info to RTT
			NRF_LOG_FLUSH();
			
			// Check for activity of CPU
			nrf_gpio_pin_clear(18);
			
			/* Enter low power mode when idle */
			idle_state_handle();
			
			// Check for activity of CPU
			nrf_gpio_pin_set(18);
			
		}// while(1)
}// main




